app/controllers/products_controller.rb

INSERT INTO "products" ("name", "stock_price", "strike_price", "maturity_time", "risk_free_rate", "volatility", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "risk_free_rate" = ?, "volatility" = ?, "maturity_time" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["risk_free_rate", 4.5], ["volatility", 34.5], ["maturity_time", 40.0], ["updated_at", 2017-01-26 05:02:20 UTC], ["id", 6]]
---
  def update
  	if @product.update_attributes(product_params)

SELECT  "products".* FROM "products" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
  	@products = Product.all.order('created_at DESC').paginate(page: params[:page], per_page: 10)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_product
    params_id = params[:id] || params[:product_id]
    @product = Product.find(params_id)